Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/employment/employment_rights_and_conditions/contracts_of_employment/fixed_term_or_specified_purpose_contracts.html.txt.tmx
Source language: en
Languages: ga

source: Fixed-term or specified-purpose contracts
ga: Conarthaí ar théarmaí seasta nó sainchuspóra

source: • Rights of employees on fixed-term contracts
ga: • Cearta na bhfostaithe le conarthaí ar théarmaí seasta

source: • Renewal of fixed-term contracts
ga: • Athnuachan conarthaí ar théarmaí seasta

source: Employees on fixed-term contracts have broadly similar rights to those on open-ended contracts
ga: Tá na cearta atá ag fostaithe ar théarma seasta cosúil le cearta atá acu siúd ar chonarthaí neamhiata

source: The majority of employees work under open-ended contracts of employment
ga: Oibríonn formhór fhostaithe ar chonarthaí oibre neamhiata

source: In other words, the contract continues until such time as the employer or employee ends it
ga: Sé sin, maireann an conradh go dtí go gcuireann an fostóir nó an fostaí deireadh leis

source: Many other employees however, work under fixed-term contracts
ga: Oibríonn go leor fostaithe eile, áfach, ar chonarthaí atá ar théarma seasta

source: The term, fixed-term employee, covers employees whose contract ends on a specified date, or when a specific task is completed, or when a specific event occurs
ga: Ciallaíonn an téarma, fostaí ar théarma seasta, go gcríochnaíonn conradh an fhostaí ar dháta áirithe, nó go gcríochnaíonn sé nuair atá tasc áirithe déanta nó imeacht áirithe tarlaithe

source: Generally, a fixed-term contract ends on an agreed date
ga: Go ginearálta, críochnaíonn conradh ar théarma seasta ar dháta atá réitithe roimh réidh

source: The period of such a contract may range from a matter of months up to a period of a year or more
ga: Maireann conradh dhá leithéid roinnt míonna nó bliain nó níos mó

source: However, a fixed-term contract can also involve a specified-purpose and so may not end on a specific date
ga: Ach, dá mbeadh cuspóir sonrach ag baint leis an gconradh ní chríochnódh sé ar dháta a bheadh socraithe roimh réidh

source: Rather, it is agreed that the contract will finish when a particular stated task is completed, such as replacing an employee while she is on maternity leave
ga: Is é an réiteach a bheadh ansin ann, áfach, ná go gcríochnódh an conradh nuair a bheadh tasc áirithe curtha i gcrích, mar shampla duine a chuir in áit fostú a bheadh ar saoire máithreachais

source: The expression, fixed-term contract, is used for convenience here
ga: Úsáidtear an téarma, conradh ar théarma seasta, ar son na héascachta anseo

source: It also includes specified-purpose contracts
ga: Tá conradh sainchuspóra san áireamh freisin

source: Rights of employees on fixed-term contracts
ga: Cearta na bhfostaithe le conarthaí ar théarmaí seasta

source: Generally speaking, people employed under such contracts have the same rights as other employees
ga: Go ginearálta, tá na cearta céanna ag fostaithe ar na conarthaí seo le haon fhostaithe eile

source: For example, employees with fixed-term contracts have the normal entitlement to annual leave (holidays), maternity leave, and wage slips
ga: Mar shampla, tá na fostaithe ar théarmaí seasta i dteideal na teidlíochtaí normálta saoire bliantúil (saoire mháithreachais, agus duillíní pá

source: The Terms of Employment (Information) Acts 1994–2014 require that employees with a fixed-term contract get written notice of the expiry date
ga: Faoin Acht um Théarmaí Fostaíochta (Faisnéis) 1994–2014 tá sé de dhualgas ar an bhfostóir go dtugtar dáta éaga an chonartha do na fostaithe atá ar théarmaí seasta

source: The Protection of Employees (Fixed-Term Work) Act 2003 applies to most employees on fixed-term contracts
ga: Baineann An tAcht um Chosaint Fostaithe (Obair Téarma Socraithe) 2003 le formhór na bhfostaithe ar théarmaí seasta

source: However, it does not apply to agency workers placed by a temporary work agency at the disposition of a user enterprise or to apprentices, trainees and people in publicly-funded employment schemes such as Community Employment
ga: Ní bhaineann sé, áfach, le hoibrithe ghníomhaíochta atá curtha ag diúscairt gnóthais úsáideora, le printísigh, daoine faoi oiliúint, agus daoine atá ag obair le scéimeanna fostaíochta atá maoinithe ag an Stát mar shampla, Fostaíocht Pobail

source: The Act does apply to agency workers employed directly by an employment agency
ga: Baineann an tAcht le hoibrithe ghníomhaíochta atá fostaithe go díreach ag gníomhas fostaíochta

source: The Act provides that fixed-term employees may not be treated less favourably than comparable permanent employees unless the employer can objectively justify the different treatment
ga: De réir an tAcht, níl aon chead ag fostóirí déileáil go fabhrach le fostaithe lánaimseartha thar na bhfostaithe comhchéime atá ar théarma seasta gan bheith in ann an cóireáil difriúil a chosaint go hoibiachtúil

source: Any justification offered cannot be connected with the fact that the employee is on a fixed-term contract
ga: Ní féidir baint a bheith ag an bhfíréanú a thugtar leis an chúis go bhfuil an fostaí ar théarma seasta

source: The definition of comparable employees, the conditions attached and the enforcement mechanisms are similar to those for part-time employees
ga: Tá an t-sainmhíniú ar fhostaithe comhchéime, na coinníollacha a bhaineann leis agus na sásra forfheidhmithe an-chosúil leo siúd atá ag fostaithe páirt-aimseartha

source: Only those fixed-term employees whose normal hours of work are less than 20% of the normal hours of the comparable permanent employees can be excluded from entitlement to join a pension scheme
ga: Níl fostaithe ar théarmaí seasta a bhfuil a gnáth uaireanta oibre 20% níos lú ná gnáth uaireanta oibre fostaithe comhchéime lánaimseartha i dteideal páirt a ghlacadh i scéim pinsean

source: As far as is practicable, an employer is required to help a fixed-term employee to access training to enhance skills, career development and job mobility
ga: Chomh fada agus atá indéanta, tá sé de dhualgas ar an bhfostóir cúnamh a thabhairt do fhostaí ar théarma seasta cúrsaí oiliúna a dhéanamh a chuirfeadh lena scileanna, agus a chabhródh lena bhforbairt gairme agus soghluaisteacht ó phost go chéile

source: Maternity leave: an employee on a fixed-term contract is entitled to full maternity leave
ga: Saoire mháithreachais: tá fostaí ar théarmaí seasta i dteideal saoire mháithreachais iomlán

source: However, if her fixed-term contract ends before the last day of maternity leave, this counts as the last day of maternity leave
ga: Áfach, má chríochnaíonn an conradh ar théarma seasta roimh an deireadh lá saoire mháithreachais, áirítear é mar an deireadh lá saoire mháithreachais

source: This means that if the fixed-term contract ends during maternity leave, then the employee’s contract of employment terminates on that date
ga: Ciallaíonn sé má chríochnaíonn an conradh ar théarma seasta i rith shaoire mháithreachais, críochnaíonn conradh fostaíochta an fhostaí ar an dáta sin

source: This does not affect entitlement to the full 26 weeks of Maternity Benefit
ga: Ní bhainfidh sé seo leis an teidlíocht 26 seachtain iomlán Sochar Máithreachais

source: An employer must provide a fixed-term employee with a written statement as soon as possible, outlining what will trigger an end to the contract
ga: Caithfidh an fostóir ráiteas scríofa a sholáthar chomh luath agus is féidir don fhostaí atá ar théarma seasta a chuireann in iúl cad a chuirfidh deireadh leis an gconradh

source: That is, whether the contract will end on a specific date, following completion of a specific task or a specific event
ga: Sé sin, an gcríochnóidh an conradh ar dháta áirithe, nuair a bheidh tasc curtha i gcrích nó imeacht thart

source: In addition, where an employer intends to renew a fixed-term contract, a written statement must be supplied to the fixed-term employee not later than the date of renewal, setting out the objective grounds justifying the renewal and the failure to offer an open-ended contract
ga: Chomh maith leis sin, áit a bhfuil fostóir ag iarraidh conradh ar théarma seasta a athnuachan, caithfear ráiteas scríofa a chuir ar fáil don fhostaí atá ar théarma seasta roimh an dáta athnuachana, ag cur síos ar na fáthanna oibiachtúil leis an athnuachan agus an fáth nach bhfuil conradh neamhiata á thairiscint

source: Employers are obliged to inform fixed-term employees of vacancies for permanent positions
ga: Tá sé de dhualgas ar fhostóirí na fostaithe atá ar théarma seasta a chuir ar an eolas maidir le folúntais i bpostanna lánaimseartha

source: This may be done by means of a general announcement
ga: Is féidir é seo a dhéanamh le fógra ginearálta

source: When an employee is dismissed at the end of the contract the unfair dismissals legislation applies as normal unless the employer has availed of the provision to exclude the operation of the legislation
ga: Nuair a bhristear fostaí as a bpost nuair a thagann an conradh chun críche, tá baint aige mar is gnáth leis an reachtaíocht um dífhostú éagórach mura bhfuil an fostóir ag baint leas as an fhoráil a chuireann oibriú an reachtaíocht ar neamhní

source: To avail of that provision, the employer must put the contract in writing
ga: Chun an fhoráil a úsáid, caithfidh an fostóir an conradh a chur i scríbhinn

source: The employer must include a clause stating that the Unfair Dismissals Acts 1977–2007 will not apply where the only reason for ending the contract is the expiry of the fixed term, or the completion of the specified purpose
ga: Caithfidh an fostóir clásal a chur isteach a deireann nach mbeidh aon bhaint ag na hAchtanna um Dhífhostú Éagórach 1977–2015 más é an t-aon fháth gur cuireadh deireadh leis an gconradh ná críochnú an dáta, nó go bhfuil tasc áirithe curtha i gcrích

source: Both the employer and the employee must sign the contract
ga: Caithfidh an fostóir agus an fostaí an conradh a shíniú

source: An employee who has worked continuously for at least 104 weeks under a fixed-term or specified purpose contract may qualify for a redundancy payment when the contract ends
ga: Má oibríonn fostaí ar feadh 104 seachtain le conradh ar théarma seasta, nuair tá an conradh críochnaithe d'fheadfadh go mbeidh íocaíocht iomarcaíochta ar fáil don fhostaí

source: Renewal of fixed-term contracts
ga: Athnuachan conarthaí ar théarmaí seasta

source: Employees may not be employed on a series of fixed-term contracts indefinitely
ga: Ní féidir le fostaithe a bheith fostaithe le conradh ar théarma seasta gan chrioch

source: There are 2 possible situations where this arises as follows:
ga: Tá dhá chás ann a bhféadfadh sé seo tarlú:

source: • If an employee whose employment started before 14 July 2003 has completed 3 years’ continuous service as a fixed-term employee, the employer may renew their fixed-term contract only once for a period of no more than 1 year
ga: • Nuair atá 3 bliana fostaíochta leanúnacha curtha isteach ag a leithéid de fhostaí a thosaigh mar fostaí ar théarma seasta roimh 14ú Iúl 2003 ní fhéadfadh an fostóir an conradh téarma seasta a athnuachan ach ar ócáid amháin, sin uile

source: • If an employee whose employment started after 14 July 2003 has been employed on 2 or more continuous fixed-term contracts, the total duration of those contracts may not exceed 4 years
ga: • Nuair atá fostaí fostaithe ag an fostóir tar éis 14ú Iúl 2003 ar dhá nó níos mó conarthaí ar théarmaí seasta leanúnacha, ní chóir go mbeadh téarma comhiomlán na conarthaí níos faide ná 4 bliana

source: After this, if the employer wishes to renew the employee’s contract, it must be an open-ended contract unless there are objective grounds justifying the renewal of the contract for a fixed term only
ga: Nuair nach gcomhlíonann athnuachan an chonartha ar théarma seasta leis na riachtanais seo agus nuair nach féidir é a mhíniú go hoibiachtúil, glactar leis mar chonradh neamhiata

source: The Unfair Dismissal Acts 1977–2015 contain a provision aimed at ensuring that successive temporary contracts are not used in order to avoid that legislation
ga: Tá foráil san tAcht um Dífhostú Éagórach 1977–2007 a bhfuil sé mar aidhm aigea chinntiú nach n-úsáidtear conarthaí leantacha sealadach chun reachtaíocht a sheachaint

source: Where a fixed-term or specified-purpose contract expires and the individual is re-employed within 3 months, the individual is deemed to have continuous service
ga: Nuair a éagann conradh sainchuspóra nó conradh ar théarma seasta agus tá an duine ath-fhostaithe laistigh de 3 mhí, glactar leis go bhfuil an duine ar sheirbhís leanúnach oibre

source: Therefore, even where an employer excludes the unfair dismissals legislation in the manner described above, an adjudicator of the Workplace Relations Commission will consider whether the use of such contracts was wholly or partly to avoid the employee having the protection of the unfair dismissals legislation
ga: Mar sin, fiú má tá fostóir ag cuir an reachtaíocht um dhífhostú éagórach as an áireamh sa gcaoi a chuirtear síos air thuas, rialóidh breithneoir an Choimisiúin um Chaidreamh san Áit Oibre an bhfuiltear ag úsáid na conarthaí seo chun cosaint an fhostaí faoin reachtaíocht um dífhostú éagórach a sheachaint

source: If it is considered that this was the case and the contracts were not separated by more than 3 months and the job was at least similar, then the case can be dealt with as if there was continuous employment and the employer will be required to justify the dismissal in the normal manner
ga: Má rialaítear go raibh sé sin amhlaidh agus nach raibh bearna de 3 mhí nó níos mó idir na conarthaí agus go raibh na postanna cosúil le chéile, is féidir déileáil leis an gcás ar nós go raibh fostaíocht leanúnach i gceist agus beidh ar an fostóir an dífhostú a mhíniú ar an ngnáth bhealach

source: Claims under the Protection of Employees (Fixed-Term Work) Act 2003 or for unfair dismissal may be brought using the online complaint form available on workplacerelations.ie
ga: Is féidir éilimh faoin Acht um Chosaint Fostaithe 2003 nó do dhífhostú éagórach a chur tríd an fhoirm ghearáin ar líne a úsáid á fáil ar workplacerelations.ie

source: An employer is prohibited from victimising a fixed-term employee who seeks to avail of rights under the Protection of Employees (Fixed-Term Work) Act 2003
ga: Tá cosc ar an fostóir íospairt a dhéanamh ar fhostaí atá ar chonradh téarma seasta atá ag iarraidh a chearta faoin Acht um Chosaint Fostaithe 2003

source: Victimisation includes dismissal in order to avoid a fixed-term contract being considered an open-ended contract
ga: Luaitear íospairt le dífhostú chun go seachnófaí conradh téarma seasta a thomhais mar chonradh neamhiata

source: For further information you can read the explanatory leaflet on Protection of Employees (Fixed-Term Work) Act 2003 (pdf) or you can contact the Workplace Relations Commission's Information and Customer Service - see 'Where to apply' below. Where to apply Workplace Relations Commission Information and Customer Service O'Brien Road Carlow R93 W7W2 Ireland Opening Hours: Mon. to Fri
ga: Tuilleadh eolais ón mbileog míniúchán ar an Acht um Chosaint Fostaithe (Obair Téarma Shocraithe) 2003 (pdf) nó teagmháil a dhéanamh leis an tSeirbhís Fhaisnéise agus Custaiméara an Choimisiúin um Chaidreamh san Áit Oibre
